index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ro" xml:lang="ro">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tehnologii Web 2025</title>
<meta name="author" content="Petru Rebeja" />
<meta name="description" content="Pagina laboratorului Tehnologii Web 2025. Facultatea de Informatică, Universitatea „Alexandru Ioan Cuza” din Iași." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tehnologii Web 2025</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Cuprins</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#s01">Săptămâna 1</a></li>
<li><a href="#s02">Săptămâna 2</a></li>
<li><a href="#s03">Săptămâna 3</a></li>
<li><a href="#s04">Săptămâna 4</a></li>
<li><a href="#s05">Săptămâna 5</a></li>
<li><a href="#s06">Săptămâna 6</a></li>
<li><a href="#s07">Săptămâna 7</a></li>
<li><a href="#proiecte">Proiecte</a>
<ul>
<li><a href="#org9a7b23d">Preambul</a></li>
<li><a href="#orgdb5fd73">Propuneri proiecte</a>
<ul>
<li><a href="#org0cd9faa"><code>DeW</code> &#x2014; Device Web Recommender</a></li>
<li><a href="#orgd822b7a"><code>AMa</code> &#x2014; Abbreviation Management</a></li>
<li><a href="#org60afded"><code>GoH</code> &#x2014; The Game of SuperHeroes</a></li>
<li><a href="#org74d6dce"><code>WoW</code> &#x2014; Workout Web Generator</a></li>
<li><a href="#orgc5d19f9"><code>MeR</code> &#x2014; Media Review Manager</a></li>
<li><a href="#org6c51611"><code>ReW</code> &#x2014; Resource Web Planner</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#faq">Întrebări frecvente</a></li>
<li><a href="#resurse-utile">Resurse utile</a></li>
<li><a href="#contact">Date de contact</a>
<ul>
<li><a href="#e-mail">E-mail</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-s01" class="outline-2">
<h2 id="s01">Săptămâna 1</h2>
<div class="outline-text-2" id="text-s01">
<ul class="org-ul">
<li>Aspecte administrative</li>
<li>Recapitulare curs</li>
<li>Limbajul HTML</li>
<li>Validarea structurii HTML</li>
</ul>
</div>
</div>

<div id="outline-container-s02" class="outline-2">
<h2 id="s02">Săptămâna 2</h2>
<div class="outline-text-2" id="text-s02">
<ul class="org-ul">
<li>Recapitulare curs</li>
<li>Cascading Style Sheets</li>
<li>Validarea codului CSS</li>
</ul>
</div>
</div>

<div id="outline-container-s03" class="outline-2">
<h2 id="s03">Săptămâna 3</h2>
<div class="outline-text-2" id="text-s03">
<ul class="org-ul">
<li>Recapitulare curs</li>
<li>Continuăm experimentele cu CSS</li>
</ul>
</div>
</div>

<div id="outline-container-s04" class="outline-2">
<h2 id="s04">Săptămâna 4</h2>
<div class="outline-text-2" id="text-s04">
<ul class="org-ul">
<li>Recapitulare curs</li>
<li>Arhitectura MVC</li>
<li>CSS</li>
</ul>
</div>
</div>

<div id="outline-container-s05" class="outline-2">
<h2 id="s05">Săptămâna 5</h2>
<div class="outline-text-2" id="text-s05">
<ul class="org-ul">
<li>Recapitulare curs</li>
<li>Recapitulare HTML și CSS
<ul class="org-ul">
<li><a href="./e01/">exercițiu</a></li>
<li><a href="./e01/r/">(o posibilă) rezolvare</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-s06" class="outline-2">
<h2 id="s06">Săptămâna 6</h2>
<div class="outline-text-2" id="text-s06">
<ul class="org-ul">
<li>Recapitulare curs</li>
<li><a href="./e02/"><code>Hello World!</code> din PHP și Docker</a></li>
</ul>
</div>
</div>

<div id="outline-container-s07" class="outline-2">
<h2 id="s07">Săptămâna 7</h2>
<div class="outline-text-2" id="text-s07">
<ul class="org-ul">
<li>Recapitulare curs</li>
<li>Formulare în PHP</li>
<li>Post-Redirect-Get</li>
</ul>
</div>
</div>

<div id="outline-container-proiecte" class="outline-2">
<h2 id="proiecte">Proiecte</h2>
<div class="outline-text-2" id="text-proiecte">
</div>
<div id="outline-container-org9a7b23d" class="outline-3">
<h3 id="org9a7b23d">Preambul</h3>
<div class="outline-text-3" id="text-org9a7b23d">
<ul class="org-ul">
<li>Consultați <a href="https://edu.info.uaic.ro/web-technologies/web-projects.html">cerințele și recomandările</a> de pe pagina cursului.</li>
<li>Înscrierea echipelor și proiectelor se va face printr-un formular; acesta va fi disponibil începând de sâmbătă, 12 aprilie 2025.</li>
<li><b>Termenul-limită pentru înscrieri este 25 aprilie 2025, ora 23:59</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb5fd73" class="outline-3">
<h3 id="orgdb5fd73">Propuneri proiecte</h3>
<div class="outline-text-3" id="text-orgdb5fd73">
</div>
<div id="outline-container-org0cd9faa" class="outline-4">
<h4 id="org0cd9faa"><code>DeW</code> &#x2014; Device Web Recommender</h4>
<div class="outline-text-4" id="text-org0cd9faa">
<p>
Realizați o aplicație Web care recomanda utilizatorilor autentificați sau nu diverse dispozitive electronice (telefoane, tablete, ceasuri, drone,&#x2026;) în funcție de preț ori alte caracteristici – e.g., model similar, facilități, culoare, autonomie etc. Datele analizate vor fi preluate din surse multiple (fluxuri de știri, API-uri disponibile, via scraping) oferite de situri de profil ce vor putea fi precizate de utilizator. Statisticile celor mai populare produse și recomandările generate vor fi disponibile și sub formă de fluxuri de știri RSS. Bonus: functionalitățile principale vor fi oferite de o extensie de navigator Web.
</p>
</div>
</div>

<div id="outline-container-orgd822b7a" class="outline-4">
<h4 id="orgd822b7a"><code>AMa</code> &#x2014; Abbreviation Management</h4>
<div class="outline-text-4" id="text-orgd822b7a">
<p>
Să se dezvolte o aplicație Web pentru managementul – e.g., explorare, vizualizare, specificare, memorare permanentă – de abrevieri cu semnificații multiple, în diverse limbi. Pe baza facilităților de căutare multi-criterială implementate, utilizatorii autentificați vor putea crea, inventaria și partaja informații despre abrevieri în funcție de diverse caracteristici (limbă, domeniu, dată etc.). Intern, informațiile referitoare la abrevieri vor fi stocate recurgând la <a href="https://docbook.org/">DocBook</a>. Suplimentar, se va oferi suport pentru export (d)in formate precum HTML (e.g., &lt;dt&gt;&lt;dd&gt;) și Markdown. Se vor genera statistici diverse ce pot fi exportate în formate deschise – minimal, CSV si PDF. Se va crea, de asemenea, un clasament al celor mai accesate abrevieri, disponibil și ca flux de date RSS.
</p>
</div>
</div>

<div id="outline-container-org60afded" class="outline-4">
<h4 id="org60afded"><code>GoH</code> &#x2014; The Game of SuperHeroes</h4>
<div class="outline-text-4" id="text-org60afded">
<p>
Pe baza <a href="https://www.kaggle.com/fivethirtyeight/fivethirtyeight-comic-characters-dataset">datelor despre super-eroi</a>, să se creeze un joc Web educativ – cu scenariu, niveluri de dificulate, miză și condiții de victorie/înfrângere stabilite de echipă – destinat adolescentilor. Clasamentul celor mai buni jucatori va fi disponibil și ca flux RSS. Este necesară implementarea aspectelor precum <a href="https://www.w3.org/standards/webdesign/i18n">internaționalizarea</a> și <a href="https://www.w3.org/WAI/fundamentals/accessibility-intro/">accesibilitatea</a>.
</p>
</div>
</div>

<div id="outline-container-org74d6dce" class="outline-4">
<h4 id="org74d6dce"><code>WoW</code> &#x2014; Workout Web Generator</h4>
<div class="outline-text-4" id="text-org74d6dce">
<p>
Să se creeze o aplicație Web ce le propune utilizatorilor diverse tipuri de antrenamente privind activități de fizioterapie, kinetoterapie și/sau cu caracter sportiv. Exercițiile fizice gestionate vor fi personalizate în funcție de greutate, înălțime, vârsta, gen, condiție de sănătate și altele. Utilizatorii autentificați vor putea să specifice preferințe pentru antrenamentul dorit: grupe de mușchi, durată, locație (aer liber, acasă) etc, iar aplicația va genera o rutină cu instrucțiuni detaliate, plus exemple foto/video. Sistemul va oferi statistici relevante pentru fiecare utilizator în parte, care vor fi disponibile și ca flux de date RSS. Mai mult, un clasament al celor mai activi utilizatori – conform clasei de vârsta, tipului de antrenament etc. – va fi disponibil public, inclusiv în formatele JSON și PDF.
</p>
</div>
</div>


<div id="outline-container-orgc5d19f9" class="outline-4">
<h4 id="orgc5d19f9"><code>MeR</code> &#x2014; Media Review Manager</h4>
<div class="outline-text-4" id="text-orgc5d19f9">
<p>
Se dorește crearea unei aplicații Web care permite specificarea adnotărilor textuale și a meta-datelor, plus exprimarea opiniilor vizând conținuturi (multi)media – de exemplu, imagini și/sau video-clipuri – realizate de o persoană sau grup de persoane. Sistemul va realiza managementul acesor conținuturi, inclusiv organizarea lor pe diverse criterii: categorie, an al realizării, legături cu alte resurse înrudite etc. Se vor oferi statistici textuale și grafice exportate în formate deschise – minimal, CSV și SVG, respectiv. Diversele anunțuri (o persoană a comentat un video-clip, a apărut o altă listă de filme de interes, modificarea clasamentului celor mai apreciate imagini ale lunii etc.) vor fi expuse ca flux de știr RSS. Listele de filme preferate vor fi importate/exportate (d)in formate precum JSON și XML. Bonus: recurgerea la un serviciu online (DailyMotion, Vimeo, Instagram, Unsplash).
</p>
</div>
</div>

<div id="outline-container-org6c51611" class="outline-4">
<h4 id="org6c51611"><code>ReW</code> &#x2014; Resource Web Planner</h4>
<div class="outline-text-4" id="text-org6c51611">
<p>
Să se dezvolte o aplicație Web care permite gestionarea pe categorii a articolelor esențiale și consumabilelor (e.g., becuri, lemne pentru foc, condimente, toner, cosmetice, pahare de unică folosință, pioneze, medicamente de uz general, &#x2026;), plus a pieselor de schimb pentru diverse dispozitive &#x2013; de exemplu, aparate electr(on)ice, automobile, ascensoare etc. &#x2013; dintr-o gospodărie, organizație sau întreprindere. Instrumentul va fi capabil să notifice, periodic sau la date fixe (eventual, prestabilite), utilizatorul sau un grup de utilizatori în ceea ce privește epuizarea iminentă a unor materiale sau verificarea anumitor echipamente și angrenaje. Aceste notificări vor fi semnalate atât direct în cadrul interfeței aplicației, cât și prin poșta electronică. Se vor oferi posibilități de importare/exportare a datelor in formatele CSV, JSON și XML, iar diversele statistici generate vor putea fi consultate sub formă de documente HTML si PDF.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-faq" class="outline-2">
<h2 id="faq">Întrebări frecvente</h2>
<div class="outline-text-2" id="text-faq">
<dl class="org-dl">
<dt>Avem voie cu documentație/calculator la examen?</dt><dd>Nu. Examenul va fi unul clasic; veți avea nevoie doar de pix și foi de hârtie.</dd>
<dt>Putem propune idei de proiecte proprii?</dt><dd>Nu.</dd>
<dt>Putem folosi <code>TypeScript</code> pentru dezvoltarea proiectului?</dt><dd>Da.</dd>
<dt>Putem folosi <code>Rust</code> pentru dezvoltarea proiectului?</dt><dd>Da, dar fără a folosi vreun cadru de lucru (framework).</dd>
<dt>Putem folosi <code>Bootstrap</code> pentru interfața Web?</dt><dd>Nu. Deși nu este cadru de lucru, este important să înțelegeți fundamentele pe care biblioteca <code>Bootstrap</code> (și altele asemănătoare) le abstractizează.</dd>
<dt>Echipele pentru proiect trebuie formate din aceeași grupă?</dt><dd>Nu neapărat. Echipele pot fi formate din grupele aceluiași profesor.</dd>
</dl>
</div>
</div>

<div id="outline-container-resurse-utile" class="outline-2">
<h2 id="resurse-utile">Resurse utile</h2>
<div class="outline-text-2" id="text-resurse-utile">
<ul class="org-ul">
<li><a href="https://replit.com/">Replit</a></li>
<li><a href="https://php-fiddle.com/">PHP-fiddle</a></li>
<li><a href="https://jsfiddle.net/">JSFiddle</a></li>
<li><a href="https://formspree.io/">Formspree</a></li>
<li><a href="https://locallhost.me/">localhost.me</a></li>
<li><a href="https://almanac.httparchive.org/en/2024/">Web Almanac 2024</a></li>
<li><a href="https://developer.mozilla.org/en-US/docs/Learn">Learn Web Development | MDN</a></li>
<li><a href="https://validator.w3.org/">https://validator.w3.org/</a></li>
</ul>
</div>
</div>

<div id="outline-container-contact" class="outline-2">
<h2 id="contact">Date de contact</h2>
<div class="outline-text-2" id="text-contact">
</div>
<div id="outline-container-e-mail" class="outline-3">
<h3 id="e-mail">E-mail</h3>
<div class="outline-text-3" id="text-e-mail">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(concat <span style="color: #3e999f;">"petru"</span> <span style="color: #3e999f;">"."</span> <span style="color: #3e999f;">"rebeja"</span> <span style="color: #3e999f;">"@gmail.com"</span>)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Petru Rebeja</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
